---
type: CentralModelContentionException
namespace: Autodesk.Revit.Exceptions
version: 2024
members: 2
tags: [revit-api, class]
---

# CentralModelContentionException

`Autodesk.Revit.Exceptions.CentralModelContentionException` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetObjectData | — | `public override void GetObjectData ( SerializationInfo info , StreamingContext context )` |
| Property | CurrentUser | — | `public string CurrentUser { get ; }` |